ija_tibet2_main/src/test/testtool/main/ExceptionLog/02/in.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<MessageHeader xmlns="http://nn.nl/XSD/Generic/MessageHeader/1">
			<From>
				<Id>Tibco4SapBP</Id>
			</From>
			<To>
				<Location>ESB.Infrastructure.US.Log.BusinessLog.2.ExceptionLog.1.Action</Location>
			</To>
			<HeaderFields>
				<CPAId>n/a</CPAId>
				<ConversationId>rn09bt_0a3b8d50-b1b2190_13a30a74c9f_-430d</ConversationId>
				<MessageId>rn09bt_0a3b8d50-b1b2190_13a30a74c9f_-430b</MessageId>
				<Timestamp>2012-10-09T16:13:39</Timestamp>
			</HeaderFields>
			<Service>
				<Name>Log</Name>
				<Context>BusinessLog</Context>
				<Action>
					<Paradigm>Action</Paradigm>
					<Name>ExceptionLog</Name>
					<Version>1</Version>
				</Action>
			</Service>
		</MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<ExceptionLog_Action xmlns="http://nn.nl/XSD/Infrastructure/Log/BusinessLog/2/ExceptionLog/1">
			<Header2>
				<MessageId>messageId1</MessageId>
				<ConversationId>conversationId2</ConversationId>
				<CPAId>cpaId9</CPAId>
				<BusinessDomain>businessDomain3</BusinessDomain>
				<ServiceName>serviceName4</ServiceName>
				<ServiceContext>serviceContext5</ServiceContext>
				<ServiceContextVersion>6</ServiceContextVersion>
				<OperationName>operationName7</OperationName>
				<OperationVersion>8</OperationVersion>
				<ApplicationName>applicationName9</ApplicationName>
				<ApplicationFunction>applicationFunction0</ApplicationFunction>
				<Timestamp>2001-12-17T09:30:11</Timestamp>
				<SenderId>senderId2</SenderId>
			</Header2>
			<Exception>
				<Code>code1</Code>
				<Reason>reason2</Reason>
				<Text>text3</Text>
			</Exception>
			<Message>
				<Text>text----------------------------------------1</Text>
				<Resend>
					<ConnectionFactory>connectionFactory1</ConnectionFactory>
					<ProviderUrl>providerUrl2</ProviderUrl>
					<Destination>destination3</Destination>
				</Resend>
			</Message>
		</ExceptionLog_Action>
	</soapenv:Body>
</soapenv:Envelope>
